# ScheduleId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleSheetInstance..::..ScheduleId Property
ScheduleSheetInstance Class See Also
---
Id of the primary schedule that generates this ScheduleInstance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId ScheduleId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ScheduleId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ScheduleId {
	ElementId^ get ();
}
```

# See Also
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace